In [1]:
import pandas as pd
import numpy as np

Here we are going to use a combination of Pandas DataFrame functionality and a NumPy method to quickly create a 6x6 DataFrame populated with the numbers 0 - 35, with specified column heads. If you're looking to practice with DataFrames, the `np.arange().reshape()` methods are an easy way to create one quickly.

In [2]:
test_data = pd.DataFrame(np.arange(36).reshape(6,6),columns=('alpha','bravo','charlie','delta','echo','foxtrot'))

In [3]:
test_data

   alpha  bravo  charlie  delta  echo  foxtrot
0      0      1        2      3     4        5
1      6      7        8      9    10       11
2     12     13       14     15    16       17
3     18     19       20     21    22       23
4     24     25       26     27    28       29
5     30     31       32     33    34       35

Here we are defining a function with a single argument. In this case, it takes a single value `cellNum` and applies the inner workings of the function to it. We're also using an `else:` statement to determine an action when our initial `if:` proves to be false. _Remember your indentation!_

In [4]:
def num_mod(cellNum):
    if cellNum % 2 == 0:
        return cellNum, "is even"
    else:
        return cellNum, "is odd"

Remember `.apply()` with `pd.to_datetime` earlier? The `.applymap()` method is a way to _apply_ a function to elements individually. We can index out specific cells and then apply a function. It can even be one we defined ourselves.

In [5]:
test_data.iloc[0:2,0:3].applymap(num_mod)

          alpha        bravo       charlie
0  (0, is even)  (1, is odd)  (2, is even)
1  (6, is even)  (7, is odd)  (8, is even)

Where `.applymap()` can apply to individual cells, `.apply()` works with rows, columns, or the entire DataFrame. For this function, we are adding specifically named columns within the DataFrame. We are passing a row as an argument, and the function knows to work with certain columns and ignore the rest. Like most things so far, the name _row_ shown below is only a placeholder. It's the `axis=1` that does the real work here.

In [6]:
def row_add(row):
    return row.loc['bravo'] + row.loc['delta'] + row.loc['foxtrot']

In [7]:
test_data.apply(row_add,axis=1)

0     9
1    27
2    45
3    63
4    81
5    99
dtype: int64

And remember, the apply function doesn't overwrite values unless we tell it to. Check it out!

In [8]:
test_data

   alpha  bravo  charlie  delta  echo  foxtrot
0      0      1        2      3     4        5
1      6      7        8      9    10       11
2     12     13       14     15    16       17
3     18     19       20     21    22       23
4     24     25       26     27    28       29
5     30     31       32     33    34       35

## Assignment!

1) Write a new function called three_groups that takes a single argument called cellVal

2) Using this function, perform the following three operations based upon the size of the number: (You'll need a new tool called elif (else-if) for the middle one. Try it!)

    - 0-11: Multiply it by 10
    - 12-23: Subtract 6
    - 24-35: Square it
    
3) Run the function on each value in the DataFrame